Os dados abaixo são referente a alturas em cm de 20 alunos:

![table 01.jpg](assets/table01.jpg)

Construa a distribuição de frequências por classes de valores colocando o _fi_, _fa_, _fr_ e _fra_.

In [285]:
import pandas as pd
import numpy as np

In [286]:
data = [151, 157, 158, 156, 160,
        176, 150, 149, 162, 153,
        163, 170, 172, 171, 164,
        173, 166, 165, 160, 158]

## Cálculo para _fi_

In [287]:
amplitude_maxima = max(data) - min(data)  # 176 - 149
amplitude_maxima

27

In [288]:
faixa_classes = amplitude_maxima / 3  # o 3 é a largura_classe
faixa_classes

9.0

In [289]:
a = np.arange(min(data), max(data) + faixa_classes, faixa_classes)
a[0] = a[0] - 1
a

array([148., 158., 167., 176.])

In [298]:
classes = pd.cut(data, bins=a, labels=['149 |-- 158', '158 |-- 167', '167 |-- 176']).value_counts().to_frame().reset_index()
classes.columns = ['Alturas em cm', 'fi']

In [299]:
classes

  Alturas em cm  fi
0   149 |-- 158   8
1   159 |-- 167   7
2   168 |-- 176   5